k6/path/result/smoke.log

          /\      |‾‾| /‾‾/   /‾‾/
     /\  /  \     |  |/  /   /  /
    /  \/    \    |     (   /   ‾‾\
   /          \   |  |\  \ |  (‾)  |
  / __________ \  |__| \__\ \_____/ .io

  execution: local
     script: -
     output: -

  scenarios: (100.00%) 1 scenario, 1 max VUs, 40s max duration (incl. graceful stop):
           * default: 1 looping VUs for 10s (gracefulStop: 30s)


running (01.0s), 1/1 VUs, 0 complete and 0 interrupted iterations
default   [  10% ] 1 VUs  01.0s/10s

running (02.0s), 1/1 VUs, 1 complete and 0 interrupted iterations
default   [  20% ] 1 VUs  02.0s/10s

running (03.0s), 1/1 VUs, 2 complete and 0 interrupted iterations
default   [  30% ] 1 VUs  03.0s/10s

running (04.0s), 1/1 VUs, 3 complete and 0 interrupted iterations
default   [  40% ] 1 VUs  04.0s/10s

running (05.0s), 1/1 VUs, 4 complete and 0 interrupted iterations
default   [  50% ] 1 VUs  05.0s/10s

running (06.0s), 1/1 VUs, 5 complete and 0 interrupted iterations
default   [  60% ] 1 VUs  06.0s/10s

running (07.0s), 1/1 VUs, 6 complete and 0 interrupted iterations
default   [  70% ] 1 VUs  07.0s/10s

running (08.0s), 1/1 VUs, 7 complete and 0 interrupted iterations
default   [  80% ] 1 VUs  08.0s/10s

running (09.0s), 1/1 VUs, 8 complete and 0 interrupted iterations
default   [  90% ] 1 VUs  09.0s/10s

running (10.0s), 1/1 VUs, 9 complete and 0 interrupted iterations
default   [ 100% ] 1 VUs  10.0s/10s

running (10.9s), 0/1 VUs, 10 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  10s

     ✓ got stations
     ✓ stations are not empty
     ✓ found path

     checks.........................: 100.00% ✓ 30       ✗ 0
     data_received..................: 727 kB  67 kB/s
     data_sent......................: 2.8 kB  252 B/s
     http_req_blocked...............: avg=644.69µs min=3.02µs   med=4µs     max=12.81ms  p(90)=5.05µs  p(95)=647.59µs
     http_req_connecting............: avg=445.5µs  min=0s       med=0s      max=8.91ms   p(90)=0s      p(95)=445.5µs
   ✓ http_req_duration..............: avg=42.97ms  min=30.27ms  med=40.44ms max=66.73ms  p(90)=55.51ms p(95)=59.62ms
       { expected_response:true }...: avg=42.97ms  min=30.27ms  med=40.44ms max=66.73ms  p(90)=55.51ms p(95)=59.62ms
     http_req_failed................: 0.00%   ✓ 0        ✗ 20
     http_req_receiving.............: avg=7.48ms   min=217.31µs med=4.43ms  max=26.16ms  p(90)=16.22ms p(95)=17.19ms
     http_req_sending...............: avg=21.95µs  min=12.4µs   med=14.81µs max=117.98µs p(90)=30.24µs p(95)=35.86µs
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s
     http_req_waiting...............: avg=35.47ms  min=20.03ms  med=36.36ms max=66.35ms  p(90)=47.58ms p(95)=54.8ms
     http_reqs......................: 20      1.832954/s
     iteration_duration.............: avg=1.09s    min=1.07s    med=1.08s   max=1.13s    p(90)=1.1s    p(95)=1.11s
     iterations.....................: 10      0.916477/s
     vus............................: 1       min=1      max=1
     vus_max........................: 1       min=1      max=1